# SetFillColorByClass

## Description
Procedure SetFillColorByClass sets the referenced object to use the class attribute fill colors.

```pascal
PROCEDURE SetFillColorByClass(h : HANDLE);
```

```python
def vs.SetFillColorByClass(h):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|

## Remarks
Sets so that the class fill colors are used for the object referenced by h.
[sd 8/19/98]

## Version
Availability: from VectorWorks8.0

## Category
* Object Attributes